mm32/mm32_classb_cm0/iec60730b_f0020/Device/MM32F0020/Include/reg_rcc.h
#define RCC_CIR_PLLRDYF_Pos             (4)
#define RCC_CIR_PLLRDYF                 (0x01U << RCC_CIR_PLLRDYF_Pos)          ///< PLL Ready Interrupt flag

#define RCC_CIR_CSSF_Pos                (7)
#define RCC_CIR_CSSF                    (0x01U << RCC_CIR_CSSF_Pos)             ///< Clock Security System Interrupt flag
#define RCC_CIR_LSIRDYIE_Pos            (8)
#define RCC_CIR_LSIRDYIE                (0x01U << RCC_CIR_LSIRDYIE_Pos)         ///< LSI Ready Interrupt Enable


#define RCC_CIR_HSIRDYIE_Pos            (10)
#define RCC_CIR_HSIRDYIE                (0x01U << RCC_CIR_HSIRDYIE_Pos)         ///< HSI Ready Interrupt Enable
#define RCC_CIR_HSERDYIE_Pos            (11)
#define RCC_CIR_HSERDYIE                (0x01U << RCC_CIR_HSIRDYIE_Pos)         ///< HSE Ready Interrupt Enable

#define RCC_CIR_PLLRDYIE_Pos            (12)
#define RCC_CIR_PLLRDYIE                (0x01U << RCC_CIR_PLLRDYIE_Pos)         ///< PLL Ready Interrupt Enable

#define RCC_CIR_LSIRDYC_Pos             (16)
#define RCC_CIR_LSIRDYC                 (0x01U << RCC_CIR_LSIRDYC_Pos)          ///< LSI Ready Interrupt Clear


#define RCC_CIR_HSIRDYC_Pos             (18)
#define RCC_CIR_HSIRDYC                 (0x01U << RCC_CIR_HSIRDYC_Pos)          ///< HSI Ready Interrupt Clear
#define RCC_CIR_HSERDYC_Pos             (19)
#define RCC_CIR_HSERDYC                 (0x01U << RCC_CIR_HSERDYC_Pos)          ///< HSE Ready Interrupt Clear

#define RCC_CIR_HSERDYC_Pos             (19)
#define RCC_CIR_HSERDYC                 (0x01U << RCC_CIR_HSERDYC_Pos)          ///< HSE Ready Interrupt Clear

#define RCC_CIR_PLLRDYC_Pos             (20)
#define RCC_CIR_PLLRDYC                 (0x01U << RCC_CIR_PLLRDYC_Pos)          ///< PLL Ready Interrupt Clear

#define RCC_CIR_CSSC_Pos                (23)
#define RCC_CIR_CSSC                    (0x01U << RCC_CIR_CSSC_Pos)             ///< Clock Security System Interrupt Clear




////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB1RSTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_APB1RSTR_TIM3_Pos           (1)
#define RCC_APB1RSTR_TIM3               (0x01U << RCC_APB1RSTR_TIM3_Pos)        ///< Timer 2 reset
#define RCC_APB1RSTR_TIM1_Pos           (2)
#define RCC_APB1RSTR_TIM1               (0x01U << RCC_APB1RSTR_TIM1_Pos)        ///< Timer 3 reset
#define RCC_APB1RSTR_TIM14_Pos          (3)
#define RCC_APB1RSTR_TIM14              (0x01U << RCC_APB1RSTR_TIM3_Pos)        ///< Timer 14 reset

#define RCC_APB1RSTR_ADC1_Pos           (9)
#define RCC_APB1RSTR_ADC1               (0x01U << RCC_APB1RSTR_ADC1_Pos)        ///< ADC Configuration register reset

#define RCC_APB1RSTR_WWDG_Pos           (11)
#define RCC_APB1RSTR_WWDG               (0x01U << RCC_APB1RSTR_WWDG_Pos)        ///< Window Watchdog reset
#define RCC_APB1RSTR_SPI1_Pos           (12)
#define RCC_APB1RSTR_SPI1               (0x01U << RCC_APB1RSTR_SPI1_Pos)        ///< SPI 1 reset
#define RCC_APB1RSTR_UART1_Pos          (16)
#define RCC_APB1RSTR_UART1              (0x01U << RCC_APB1RSTR_UART1_Pos)       ///< UART 1 reset

#define RCC_APB1RSTR_UART2_Pos          (17)
#define RCC_APB1RSTR_UART2              (0x01U << RCC_APB1RSTR_UART2_Pos)       ///< UART 2 reset
#define RCC_APB1RSTR_I2C1_Pos           (21)
#define RCC_APB1RSTR_I2C1               (0x01U << RCC_APB1RSTR_I2C1_Pos)        ///< I2C 1 reset



#define RCC_APB1RSTR_PWR_Pos            (28)
#define RCC_APB1RSTR_PWR                (0x01U << RCC_APB1RSTR_PWR_Pos)         ///< Power interface reset

#define RCC_APB1RSTR_DBGMCU_Pos         (29)
#define RCC_APB1RSTR_DBGMCU             (0x01U << RCC_APB1RSTR_DBGMCU_Pos)      ///< DBGMCU register reset

#define RCC_APB1RSTR_EXTI_Pos           (30)
#define RCC_APB1RSTR_EXTI               (0x01U << RCC_APB1RSTR_EXTI_Pos)        ///< EXTI register reset

#define RCC_APB1RSTR_SYSCFG             RCC_APB1RSTR_EXTI                       ///< System Configuration register reset
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_AHBENR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_AHBENR_SRAM_Pos             (2)
#define RCC_AHBENR_SRAM                 (0x01U << RCC_AHBENR_SRAM_Pos)          ///< SRAM interface clock enable
#define RCC_AHBENR_FLITF_Pos            (4)
#define RCC_AHBENR_FLITF                (0x01U << RCC_AHBENR_FLITF_Pos)         ///< FLITF clock enable
#define RCC_AHBENR_CRC_Pos              (6)
#define RCC_AHBENR_CRC                  (0x01U << RCC_AHBENR_CRC_Pos)           ///< Internal High Speed clock Calibration

#define RCC_AHBENR_GPIOA_Pos            (17)
#define RCC_AHBENR_GPIOA                (0x01U << RCC_AHBENR_GPIOA_Pos)         ///< GPIOA clock enable
#define RCC_AHBENR_GPIOB_Pos            (18)
#define RCC_AHBENR_GPIOB                (0x01U << RCC_AHBENR_GPIOB_Pos)         ///< GPIOB clock enable


////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB1ENR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_APB1ENR_TIM3_Pos            (1)
#define RCC_APB1ENR_TIM3                (0x01U << RCC_APB1ENR_TIM3_Pos)         ///< Timer 3 clock enabled


#define RCC_APB1ENR_TIM1_Pos            (2)
#define RCC_APB1ENR_TIM1                (0x01U << RCC_APB1ENR_TIM1_Pos)         ///< TIM1 Timer clock enable

#define RCC_APB1ENR_TIM14_Pos           (3)
#define RCC_APB1ENR_TIM14               (0x01U << RCC_APB1ENR_TIM14_Pos)        ///< TIM14 Timer clock enable
#define RCC_APB1ENR_ADC1_Pos            (9)
#define RCC_APB1ENR_ADC1                (0x01U << RCC_APB1ENR_ADC1_Pos)         ///< ADC 1 interface clock enable

#define RCC_APB1ENR_WWDG_Pos            (11)
#define RCC_APB1ENR_WWDG                (0x01U << RCC_APB1ENR_WWDG_Pos)         ///< Window Watchdog clock enable

#define RCC_APB1ENR_SPI1_Pos            (12)
#define RCC_APB1ENR_SPI1                (0x01U << RCC_APB1ENR_SPI1_Pos)         ///< SPI 1 clock enable


#define RCC_APB1ENR_UART1_Pos           (16)
#define RCC_APB1ENR_UART1               (0x01U << RCC_APB1ENR_UART1_Pos)        ///< UART 1 clock enable
#define RCC_APB1ENR_UART2_Pos           (17)
#define RCC_APB1ENR_UART2               (0x01U << RCC_APB1ENR_UART2_Pos)        ///< UART 2 clock enable
#define RCC_APB1ENR_I2C1_Pos            (21)
#define RCC_APB1ENR_I2C1                (0x01U << RCC_APB1ENR_I2C1_Pos)         ///< I2C 1 clock enable




#define RCC_APB1ENR_PWR_Pos             (28)
#define RCC_APB1ENR_PWR                 (0x01U << RCC_APB1ENR_PWR_Pos)          ///< Power interface clock enable


#define RCC_APB1ENR_DBGMCU_Pos          (29)
#define RCC_APB1ENR_DBGMCU              (0x01U << RCC_APB1ENR_DBGMCU_Pos)       ///< DBGMCU clock enable

